# DataFrame

In [1]:
import pandas as pd

In [2]:
data = ['Devendra','Nishant','yogi','md','danish']

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df)

          0
0  Devendra
1   Nishant
2      yogi
3        md
4    danish

In [5]:
# Data Frame un List from

In [6]:
data_list = [['Devendra',10],['Nishant',20],['yogi',35],['md',25],['danish',20]]

In [7]:
df1 = pd.DataFrame(data_list,columns=['Name','no'])

In [8]:
print(df1)

       Name  no
0  Devendra  10
1   Nishant  20
2      yogi  35
3        md  25
4    danish  20

In [9]:
# Dataframe in dict from

In [10]:
data_dict = {'Hero':['batman','superman','ironman'],'age':[32,35,56]}

In [11]:
df2 = pd.DataFrame(data_dict)

In [12]:
print(df2)

       Hero  age
0    batman   32
1  superman   35
2   ironman   56

In [13]:
#namin Index

In [14]:
df3 = pd.DataFrame(data_dict,index=['1','2','3'])

In [15]:
print(df3)

       Hero  age
1    batman   32
2  superman   35
3   ironman   56

In [16]:
#DataFrames from list of Dicts

In [17]:
data = [{'x':2,'y':3,'z':4},{'x':20,'y':30,'z':40 }]
df4 = pd.DataFrame(data)

In [18]:
print(df4)

    x   y   z
0   2   3   4
1  20  30  40

# Series

In [19]:
import numpy as np

In [20]:
deatils = np.array(['x','y','z','a','b','c','d'])

In [21]:
ser = pd.Series(deatils)

In [22]:
print(ser)

0    x
1    y
2    z
3    a
4    b
5    c
6    d
dtype: object

In [23]:
# examle
import pandas as pd
import numpy as np

ser = pd.Series()
print(ser)

data = np.array([1,2,3,4,5,6,7,8,9,'0'])
ser = pd.Series(data)

print(ser)

Series([], dtype: float64)
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: object

C:\Users\Akshay Khetan\anaconda3\lib\site-packages\ipykernel_launcher.py:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """

In [24]:
# Indexinfg column

In [25]:
ser2 = pd.Series(deatils,index=[0,1,2,3,4,5,6])
print(ser2)

0    x
1    y
2    z
3    a
4    b
5    c
6    d
dtype: object

In [26]:
ser_dict ={'x':0,'y':1,'z':2}

In [27]:
ser3 = pd.Series(ser_dict)

In [28]:
print(ser3)

x    0
y    1
z    2
dtype: int64

In [29]:
ser3.index


#basic viewing of data

Index(['x', 'y', 'z'], dtype='object')

In [30]:
data_1 ={'alphabets':['a','b','c','d','e','f','g','h'],'no':[1,2,3,4,5,6,7,8]}

In [31]:
df = pd.Series(data_1)

In [32]:
print(df)

alphabets    [a, b, c, d, e, f, g, h]
no           [1, 2, 3, 4, 5, 6, 7, 8]
dtype: object

In [33]:
df1 = pd.DataFrame(data_1)

In [34]:
print(df1)

  alphabets  no
0         a   1
1         b   2
2         c   3
3         d   4
4         e   5
5         f   6
6         g   7
7         h   8

In [35]:

df1  #variable name can be used to print data se

  alphabets  no
0         a   1
1         b   2
2         c   3
3         d   4
4         e   5
5         f   6
6         g   7
7         h   8

In [36]:
df

alphabets    [a, b, c, d, e, f, g, h]
no           [1, 2, 3, 4, 5, 6, 7, 8]
dtype: object

In [37]:
df1.axes

[RangeIndex(start=0, stop=8, step=1),
 Index(['alphabets', 'no'], dtype='object')]

In [38]:
df1.dtypes

alphabets    object
no            int64
dtype: object

In [39]:
df.empty  #will return if any value if null or empty

False

In [40]:
df1.size

16

In [41]:
df1.values

array([['a', 1],
       ['b', 2],
       ['c', 3],
       ['d', 4],
       ['e', 5],
       ['f', 6],
       ['g', 7],
       ['h', 8]], dtype=object)

In [42]:
df.head()

alphabets    [a, b, c, d, e, f, g, h]
no           [1, 2, 3, 4, 5, 6, 7, 8]
dtype: object

In [43]:
df1.head(2)

  alphabets  no
0         a   1
1         b   2

In [44]:
df1.tail()

  alphabets  no
3         d   4
4         e   5
5         f   6
6         g   7
7         h   8

In [45]:
df1.tail(3)

  alphabets  no
5         f   6
6         g   7
7         h   8



#advance viwewing technique

In [46]:
df1.sum()

alphabets    abcdefgh
no                 36
dtype: object

In [47]:
df1.mean()  #works only on int , number functiomn

no    4.5
dtype: float64

In [48]:
df.count()

2

In [49]:
df1.count()

alphabets    8
no           8
dtype: int64

In [50]:
df1.min()

alphabets    a
no           1
dtype: object

In [51]:
df1.max()

alphabets    h
no           8
dtype: object

In [52]:


df1.describe()

            no
count  8.00000
mean   4.50000
std    2.44949
min    1.00000
25%    2.75000
50%    4.50000
75%    6.25000
max    8.00000

In [53]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   alphabets  8 non-null      object
 1   no         8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [54]:
data_5 = {'Actor':['jhonny','ab','sk','ak','ak'],
         'age':[42,38,48,40,38],
         'adress':['bandra','navi mumbai','pta nahi','kya pata','ced'],
         'movies':['poc','cfewf','dev','ecvsf','verce']}

In [55]:
df3 = pd.DataFrame(data_5)

In [56]:
df3

    Actor  age       adress movies
0  jhonny   42       bandra    poc
1      ab   38  navi mumbai  cfewf
2      sk   48     pta nahi    dev
3      ak   40     kya pata  ecvsf
4      ak   38          ced  verce

In [57]:
df3['Actor']

0    jhonny
1        ab
2        sk
3        ak
4        ak
Name: Actor, dtype: object

In [58]:
df3['age']

0    42
1    38
2    48
3    40
4    38
Name: age, dtype: int64

In [59]:
df3[['Actor','movies']]

    Actor movies
0  jhonny    poc
1      ab  cfewf
2      sk    dev
3      ak  ecvsf
4      ak  verce

# Roe Selection

In [60]:
df3[df3['Actor']=='sk']

  Actor  age    adress movies
2    sk   48  pta nahi    dev

In [61]:
df3[(df3['Actor']=='ak') & (df3['movies']=='verce')]

  Actor  age adress movies
4    ak   38    ced  verce

In [62]:
df3[df3['age']>40]

    Actor  age    adress movies
0  jhonny   42    bandra    poc
2      sk   48  pta nahi    dev

# .loc[] method

loc method takes lable index and return data frames according to it.

In [63]:
data_5 = {'Actor':['jhonny','ab','sk','ak','ak'],
         'age':[42,38,48,40,38],
         'adress':['bandra','navi mumbai','pta nahi','kya pata','ced'],
         'movies':['poc','cfewf','dev','ecvsf','verce']}

In [64]:
df = pd.DataFrame(data_5,index = ['a','b','c','d','e'])

In [65]:
df

    Actor  age       adress movies
a  jhonny   42       bandra    poc
b      ab   38  navi mumbai  cfewf
c      sk   48     pta nahi    dev
d      ak   40     kya pata  ecvsf
e      ak   38          ced  verce

In [66]:
df.loc['a']

Actor     jhonny
age           42
adress    bandra
movies       poc
Name: a, dtype: object

In [67]:
df.loc[['a','b']]

    Actor  age       adress movies
a  jhonny   42       bandra    poc
b      ab   38  navi mumbai  cfewf

In [68]:
df.loc[['a','b'],'Actor']

a    jhonny
b        ab
Name: Actor, dtype: object

In [69]:
df.loc[['a','b'],['Actor','movies']]

    Actor movies
a  jhonny    poc
b      ab  cfewf

In [70]:
df.loc[:,'Actor']

a    jhonny
b        ab
c        sk
d        ak
e        ak
Name: Actor, dtype: object

In [71]:
#iloc[]



#> iloc is a method where we can choose rows and column by there index

In [72]:
data_5 = {'Actor':['jhonny','ab','sk','ak','ak'],
         'age':[42,38,48,40,38],
         'adress':['bandra','navi mumbai','pta nahi','kya pata','ced'],
         'movies':['poc','cfewf','dev','ecvsf','verce']}

In [73]:
df = pd.DataFrame(data_5)
df

    Actor  age       adress movies
0  jhonny   42       bandra    poc
1      ab   38  navi mumbai  cfewf
2      sk   48     pta nahi    dev
3      ak   40     kya pata  ecvsf
4      ak   38          ced  verce

In [74]:
df.loc[1]

Actor              ab
age                38
adress    navi mumbai
movies          cfewf
Name: 1, dtype: object

In [75]:
df.iloc[1]

Actor              ab
age                38
adress    navi mumbai
movies          cfewf
Name: 1, dtype: object

In [76]:
df.iloc[0:4]

    Actor  age       adress movies
0  jhonny   42       bandra    poc
1      ab   38  navi mumbai  cfewf
2      sk   48     pta nahi    dev
3      ak   40     kya pata  ecvsf

In [77]:
df.iloc[0:4,1]

0    42
1    38
2    48
3    40
Name: age, dtype: int64

In [78]:
df.iloc[0:4,0:3]

    Actor  age       adress
0  jhonny   42       bandra
1      ab   38  navi mumbai
2      sk   48     pta nahi
3      ak   40     kya pata

In [79]:
#adding new column

In [80]:
df['rating'] = [5.5,4.5,7.5,7,3.5]

In [81]:
df

    Actor  age       adress movies  rating
0  jhonny   42       bandra    poc     5.5
1      ab   38  navi mumbai  cfewf     4.5
2      sk   48     pta nahi    dev     7.5
3      ak   40     kya pata  ecvsf     7.0
4      ak   38          ced  verce     3.5

In [82]:
#inserFunctio

In [83]:
df.insert(2,'weight',[50,60,24,35,40])

In [84]:
df

    Actor  age  weight       adress movies  rating
0  jhonny   42      50       bandra    poc     5.5
1      ab   38      60  navi mumbai  cfewf     4.5
2      sk   48      24     pta nahi    dev     7.5
3      ak   40      35     kya pata  ecvsf     7.0
4      ak   38      40          ced  verce     3.5

#using Dict

In [85]:
df['States'] = {'goa':'jhonny','mgyh':'ab',
                'mh5yy':'sk','cryn':'ak','uy5w3yhm':'ak'}

In [86]:
df

    Actor  age  weight       adress movies  rating    States
0  jhonny   42      50       bandra    poc     5.5       goa
1      ab   38      60  navi mumbai  cfewf     4.5      mgyh
2      sk   48      24     pta nahi    dev     7.5     mh5yy
3      ak   40      35     kya pata  ecvsf     7.0      cryn
4      ak   38      40          ced  verce     3.5  uy5w3yhm

In [87]:
#drop / delete row

In [88]:
df

    Actor  age  weight       adress movies  rating    States
0  jhonny   42      50       bandra    poc     5.5       goa
1      ab   38      60  navi mumbai  cfewf     4.5      mgyh
2      sk   48      24     pta nahi    dev     7.5     mh5yy
3      ak   40      35     kya pata  ecvsf     7.0      cryn
4      ak   38      40          ced  verce     3.5  uy5w3yhm

In [89]:
df.drop(1,inplace= True)

In [90]:
df

    Actor  age  weight    adress movies  rating    States
0  jhonny   42      50    bandra    poc     5.5       goa
2      sk   48      24  pta nahi    dev     7.5     mh5yy
3      ak   40      35  kya pata  ecvsf     7.0      cryn
4      ak   38      40       ced  verce     3.5  uy5w3yhm

In [91]:
df.drop([0,3],inplace = True)

In [92]:
df

  Actor  age  weight    adress movies  rating    States
2    sk   48      24  pta nahi    dev     7.5     mh5yy
4    ak   38      40       ced  verce     3.5  uy5w3yhm

In [93]:
#drooping column
df

  Actor  age  weight    adress movies  rating    States
2    sk   48      24  pta nahi    dev     7.5     mh5yy
4    ak   38      40       ced  verce     3.5  uy5w3yhm

In [94]:
df.drop(['Actor','movies'],axis = 1, inplace = True)

In [95]:
df

   age  weight    adress  rating    States
2   48      24  pta nahi     7.5     mh5yy
4   38      40       ced     3.5  uy5w3yhm

In [96]:
df.drop('age',axis = 1, inplace = True)

In [97]:
df

   weight    adress  rating    States
2      24  pta nahi     7.5     mh5yy
4      40       ced     3.5  uy5w3yhm

In [98]:
#while dropping collumn we have to give axis or index = 1 whi;e its not compulssary for rows it takes byt default

# dealing with missing data

#isnull()

In [99]:
data_6 = {'Name':['raj',None,'djk'],
       'age':[25,26,35],
      'Course':['sf','fse',None]}

In [100]:
df = pd.DataFrame(data_6)

In [101]:
df

   Name  age Course
0   raj   25     sf
1  None   26    fse
2   djk   35   None

In [102]:
df.isnull()

    Name    age  Course
0  False  False   False
1   True  False   False
2  False  False    True

In [103]:
df[df['age'].isnull()]

Empty DataFrame
Columns: [Name, age, Course]
Index: []

In [104]:
df[df['Name'].isnull()]

   Name  age Course
1  None   26    fse

#how to fil data in nll possition

In [105]:
df

   Name  age Course
0   raj   25     sf
1  None   26    fse
2   djk   35   None

In [106]:
df.fillna('mbs')

  Name  age Course
0  raj   25     sf
1  mbs   26    fse
2  djk   35    mbs

In [107]:
df['Name'].fillna('abhi', inplace = True)
df['Course'].fillna('mba', inplace = True)

In [108]:
df

   Name  age Course
0   raj   25     sf
1  abhi   26    fse
2   djk   35    mba

#Sort_Values

sort values function make a data frame into asc or dscending using particular collumn

In [109]:
data_5 = {'Actor':['jhonny','ab','sk','ak','ak'],
         'age':[42,38,48,40,38],
         'adress':['bandra','navi mumbai','pta nahi','kya pata','ced'],
         'movies':['poc','cfewf','dev','ecvsf','verce']}

In [110]:
df = pd.DataFrame(data_5)

In [111]:
df

    Actor  age       adress movies
0  jhonny   42       bandra    poc
1      ab   38  navi mumbai  cfewf
2      sk   48     pta nahi    dev
3      ak   40     kya pata  ecvsf
4      ak   38          ced  verce

In [ ]:
df.sort_values("Age",axis=0,ascending=)